Repository: JonatanGk/trytond-purchase_approval
Catalog: locale/*.po
Languages: ca, es

# model:ir.message,text:approve_no_quotation
source: You cannot approve the request "%(request)s" because the related purchase "%(purchase)s" is not a Quotation.
ca: No pots aprovar la petició "%(request)s" perque la compra relacionada "%(purchase)s" no és un pressupost.
es: No puedes aprobar la petición "%(request)s" porque la compra relacionada "%(purchase)s" no es un presupuesto.

# model:ir.message,text:reject_no_quotation
source: You cannot cancel the request "%(request)s" because the related purchase "%(purchase)s" is not a Quotation or a Draft purchase.
ca: No pots cancel·lar la petició "%(request)s" perque la compra relacionada "%(purchase)s" no és un pressupost ni està en borrador.
es: No puedes cancelar la petición "%(request)s" porque la compra relacionada "%(purchase)s" no es un presupuesto ni está en estado borrador.

# model:ir.message,text:cancel_no_quotation_draft_purchase
source: You cannot reject the request "%(request)s" because the related purchase "%(purchase)s" is not a Quotation.
ca: No pots rebujar la petició "%(request)s" perque la compra relacionada "%(purchase)s" no és un pressupost.
es: No puedes rechazar la petición "%(request)s" porque la compra relacionada "%(purchase)s" no es un presupuesto.

# model:ir.message,text:missing_approval
source: The purchase "%(purchase)s" cannot be confirmed because it doesn't have any accepted Approval Request.
ca: La compra "%(purchase)s" no es pot confirmar perque no té cap petició d'aprovació acceptada.
es: La compra "%(purchase)s" no se puede confirmar porque no tiene ninguna petición de aprobación aceptada.

# field:purchase.purchase,approval_group:
source: Approval Group
ca: Grup d'aprovació
es: Grupo de aprobación

# field:purchase.purchase,approval_requests:
source: Approval Requests
ca: Peticions d'aprovació
es: Peticiones de aprobación

# field:purchase.purchase,approval_state:
source: Approval State
ca: Estat d'aprovació
es: Estado aprobación

# field:purchase.purchase,blockers:
source: Blockers
ca: Bloquejadors
es: Bloqueadores

# model:ir.action,name:act_approval_request
source: Approval Requests
ca: Peticions d'aprovació
es: Peticiones de aprobación

# model:ir.action,name:act_purchase_approval_requests
source: Approval Requests
ca: Peticions d'aprovació
es: Peticiones de aprobación

# model:ir.action.act_window.domain,name:act_approval_request_all
source: All
ca: Tots
es: Todos

# model:ir.action.act_window.domain,name:act_approval_request_approved
source: Approved
ca: Aprovada
es: Aprobada

# model:ir.action.act_window.domain,name:act_approval_request_pending
source: Pending
ca: Pendent
es: Pendiente

# model:ir.action.act_window.domain,name:act_approval_request_rejected
source: Rejected
ca: Rebutjada
es: Rechazada

# model:ir.ui.menu,name:menu_purchase_approval_request
source: Approval Requests
ca: Peticions d'aprovació
es: Peticiones de aprobación

# selection:purchase.purchase,approval_state:
source: Approved
ca: Aprovada
es: Aprobada

# selection:purchase.purchase,approval_state:
source: None
ca: Cap
es: Ninguno

# selection:purchase.purchase,approval_state:
source: Pending
ca: Pendent
es: Pendiente

# selection:purchase.purchase,approval_state:
source: Rejected
ca: Rebutjada
es: Rechazada
